---
title: GBXMLExportOptions
classe: Autodesk.Revit.DB.GBXMLExportOptions
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 8
---

# GBXMLExportOptions

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `String Encoding { get; }` | `gBXMLExportOptions.Encoding` | String |
| `Boolean ExportAnalyticalSystems { get; set; }` | `gBXMLExportOptions.ExportAnalyticalSystems` | Boolean |
| `ExportEnergyModelType ExportEnergyModelType { get; set; }` | `gBXMLExportOptions.ExportEnergyModelType` | ExportEnergyModelType |
| `Boolean IsConceptual { get; }` | `gBXMLExportOptions.IsConceptual` | Boolean |
| `Boolean IsValidObject { get; }` | `gBXMLExportOptions.IsValidObject` | Boolean |
| `Void Dispose()` | `gBXMLExportOptions.Dispose()` | Void |
| `IList<ElementId> GetMassIds()` | `gBXMLExportOptions.GetMassIds()` | IList<ElementId> |
| `IList<ElementId> GetMassZoneIds()` | `gBXMLExportOptions.GetMassZoneIds()` | IList<ElementId> |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```